<?php

return [
    // Владимир Владимирович Набоков
    [
        'title' => 'Собрание сочинений в 6 томах',
        'release_year' => '1990',
        'summary' => <<<EOT
            Вашему вниманию предлагается четырехтомное издание произведений всемирно известного русско-американского писателя, 
            одного из классиков литературы ХХ века, Владимира Владимировича Набокова
            EOT,
        'isbn' => '5-900195-06-6',
        'photo' => 'https://rusbuk.ru/uploads/books/1360618/e0c93642f60bdccc3ecca67fa4dc79d2e29543f4Mini.jpg',
        'author_id' => 1
    ],
    [
        'title' => 'Истинная жизнь Себастьяна Найта',
        'release_year' => '1998',
        'summary' => 'Истинная жизнь Себастьяна Найта. Пнин. Просвечивающие предметы.',
        'isbn' => '5-237-00859-3',
        'photo' => 'https://www.libex.ru/img/x/3c/00/c103c.jpg',
        'author_id' => 1
    ],
    // Фёдор Михайлович Достоевский
    [
        'title' => 'Белые ночи',
        'release_year' => '2018',
        'summary' => null,
        'isbn' => '978-5-17-106575-1',
        'photo' => 'https://www.bookpiter.ru/images/BOOK/731599.jpg',
        'author_id' => 2
    ],
    // Стругацкий Борис Натанович, Стругацкие Аркадий и Борис Натановичи
    [
        'title' => 'Жук в муравейнике',
        'release_year' => '2025',
        'summary' => <<<EOT
            После миссии Максима Каммерера на планете Саракш прошло 20 лет. Теперь он работает на Земле, в КОМКОНе-2. 
            Его очередное задание — разыскать прогрессора Льва Абалкина, самовольно покинувшего Саракш, 
            но проигнорировавшего требование зарегистрироваться на Земле. 
            Встречи Каммерера со знакомыми Абалкина вскрывают тайну, 
            способную нанести серьезный вред не только окружающим его людям, но и, возможно, всему человечеству...
            EOT,
        'isbn' => '978-5-17-111543-2',
        'photo' => 'https://ndc.book24.ru/resize/820x1180/pim/products/images/b8/f7/018fa1b1-fc2d-7bb6-8827-6d1156f7b8f7.jpg',
        'author_id' => [3, 6]
    ],
    [
        'title' => 'Путь на Амальтею. Стажеры',
        'release_year' => '2017',
        'summary' => <<<EOT
            Новые приключения знакомых героев Страны багровых туч". Быков – уже ставший командиром фотонного грузовика "Тахмасиб" 
            и его экипаж спешат на помощь обитателям базы на Амальтее, спутнике Юпитера. 
            В "Стажерах", завершающих "предполуденную" трилогию, Быков, Крутиков, Юрковский и Жилин отправляются к Сатурну, 
            по пути инспектируя несколько космических баз на Марсе и астероидах.
            EOT,
        'isbn' => '978-5-17-103151-0',
        'photo' => 'https://www.bookpiter.ru/images/BOOK/677155.jpg',
        'author_id' => [3, 6]

    ],
    // Стругацкий Борис Натанович
    [
        'title' => 'Бессильные мира сего',
        'release_year' => '2018',
        'summary' => <<<EOT
            В этот том вошел "сольный" роман Б.Н. Стругацкого "Бессильные мира сего", 
            опубликованный им под псевдонимом С.Витицкий, - яркое и интеллектуальное произведение, 
            балансирующее на тонкой грани между философской фантастикой и литературной притчей
            EOT,
        'isbn' => '978-5-17-100321-0',
        'photo' => 'https://content.img-gorod.ru/pim/products/images/e6/e4/0199e9fb-c8c0-7a30-bc37-6155cceee6e4.jpg?width=5120&height=2704',
        'author_id' => 6
    ],
    // Сергей Александрович Есенин
    [
        'title' => 'Собрание сочинений в 2 томах. 1,2',
        'release_year' => '1990',
        'summary' => <<<EOT
            Том 1. Стихотворения. Поэмы
            В том вошло трехтомное Собрание стихотворений, подготовленное С. Есениным в 1925 году.
            Слово о поэте Ю.В. Бондарева. Составление, вступительная статья и комментарии Ю.Л. Прокушева.
            Том 2. Стихотворения. Проза. Статьи. Письма
            В том включены стихотворения, не вошедшие в основное Собрание, подготовленное Есениным, проза поэта, его статьи и письма.
            EOT,
        'isbn' => '5-268-00099-3',
        'photo' => 'https://ir-8.ozone.ru/multimedia/wc1000/1000273557.jpg',
        'author_id' => 4
    ],
    // Михаил Афанасьевич Булгаков
    [
        'title' => 'Мастер и Маргарита',
        'release_year' => '2024',
        'summary' => 'Самый популярный русский роман XX века в ярком современном оформлении',
        'isbn' => '978-5-00195-960-1',
        'photo' => 'https://www.mann-ivanov-ferber.ru/assets/images/covers/87/30387/1.50x-thumb.png',
        'author_id' => 5
    ],
    [
        'title' => 'Белая гвардия',
        'release_year' => '2015',
        'summary' => <<<EOT
            Роман "Белая гвардия" — это история о "смутной мгле", павшей на родную землю, это история Гражданской войны, 
            страшного братоубийственного времени, история краха традиций и устоев, история кровопролития, 
            рассказанная глазами очевидца и участника событий.
            Работу над романом "Белая гвардия" писатель начал еще в 1922 году, 
            а в марте 1923 года в журнале "Россия" уже появилось сообщение о том, что М. Булгаков заканчивает роман. 
            "Белая гвардия" — первая большая вещь Булгакова, и настроение, с которым Булгаков входил в русскую литературу, 
            отразилось на всем его дальнейшем творчестве. 
            В этой первой булгаковской "большой прозе" уже звучат мотивы его последнего, "закатного романа" "Мастер и Маргарита".
            EOT,
        'isbn' => '978-5-389-09917-3',
        'photo' => 'https://www.bookpiter.ru/images/BOOK/573794.jpg',
        'author_id' => 5
    ],
    // Александр Сергеевич Пушкин
    [
        'title' => 'Дубровский',
        'release_year' => '1995',
        'summary' => null,
        'isbn' => '978-5-222-46588-2',
        'photo' => 'https://ndc.book24.ru/resize/820x1180/pim/products/images/01/6b/019b1341-f4a2-767a-a5c7-c84c3200016b.jpg',
        'author_id' => 7
    ],

];